/******************************************************************************************************************************************************************************************************************************盗聴は桁溢れについては考えません.あくまで桁内で収まる場合のみとします******************************************************************************************************************************************************************************************************************************/
#include <stdio.h>
#include <stdlib.h>
#include "my_math.h"
#include "output.h"
//#include <unistd.h> わんちゃん送信中ですを出すためだけに使う
int main(void){
	int p,q; //素数
	int n,f,d,e,c,m; //f,eは互いに素
	int i,j;
	int decry;
	int wiretap;

	Input_pqem(&p,&q,&e,&m);
	calc_nfd(&n,&f,&d,p,q,e);
	c = encryption(e,n,m); //送信側はe,nを元々持ってて,m(平文)を入力した想定
	test_output(p,q,n,f,d,e,c,m);
	printf("元の平文mと鍵d,p,qは(送信者は)必要なくなったので,-1で初期化します\n");
	m = -1; d = -1; p = -1; q = -1;
	printf("暗号化された値c=%dを盗聴しました\n",c);


//受信側はe,nと盗聴した値cをもっているのでここからdを探した後,復号する
	Factor(&p,&q,n);
	f = (p-1) * (q-1);
	d = calc_d(e,f);
	decry = decryption(n,d,c);
	printf("送信者の平文は%dです\n",decry);
}

